stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/mc_can.c
/*

 This file is part of the OOBD.org distribution.

 OOBD.org is free software; you can redistribute it and/or modify it
 under the terms of the GNU General Public License (version 2) as published
 by the Free Software Foundation and modified by the FreeRTOS exception.

 OOBD.org is distributed in the hope that it will be useful, but WITHOUT
 ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 more details.

 You should have received a copy of the GNU General Public License along
 with FreeRTOS.org; if not, write to the Free Software Foundation, Inc., 59
 Temple Place, Suite 330, Boston, MA  02111-1307  USA.


 OOBD C source files requirement:
 Unix EOL file format
 UTF-8
 formated with "indent -kr"

 Please ensure to read the configuration and relevant port sections of the
 online documentation.


 OOBD is using FreeRTOS (www.FreeRTOS.org)

 */

/**
 * MC specific CAN routines
 */

#include "stm32f10x.h"

/* OOBD headers. */
#include "SystemConfig.h"
#include "od_base.h"
#include "od_protocols.h"
#include "odb_can.h"
#include "mc_can.h"
#include "mc_sys.h"

extern char *oobd_Error_Text_OS;
extern struct CanConfig *canConfig;

/* callback function for received data */
recv_cbf reportReceivedData = NULL;

UBaseType_t rxCount;
UBaseType_t txCount;
UBaseType_t errCount;
UBaseType_t stCANBusOffErr;
UBaseType_t stCANBusWarningErr;
UBaseType_t stCANBusPassiveErr;
UBaseType_t ctrCANTec;
UBaseType_t ctrCANRec;

UBaseType_t bus_init_can()
{
    NVIC_InitTypeDef NVIC_InitStructure;
    extern startupProtocol;

    rxCount = 0;
    txCount = 0;
    errCount = 0;
    stCANBusOffErr = 0;
    stCANBusWarningErr = 0;
    stCANBusPassiveErr = 0;
    ctrCANTec = 0;
    ctrCANRec = 0;

    canConfig = pvPortMalloc(sizeof(struct CanConfig));
    if (canConfig == NULL) {
	DEBUGPRINT("Fatal error: Not enough heap to allocate CanConfig!\n",
		   'a');
	return pdFAIL;
    }
    canConfig->bus = VALUE_BUS_MODE_SILENT;	/* default */
    canConfig->busConfig = VALUE_BUS_CONFIG_11bit_500kbit;	/* default */

    /* Enable CAN1 Transmit interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = USB_HP_CAN1_TX_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable CAN1 Receive interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable CAN1 Receive error interrupts for CAN messages */
    NVIC_InitStructure.NVIC_IRQChannel = CAN1_SCE_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
	= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    return pdPASS;
}

/*----------------------------------------------------------------------------*/

UBaseType_t bus_send_can(data_packet * data)
{

    DEBUGUARTPRINT("\r\n*** bus_send_can entered! ***");

    CanTxMsg TxMessage;

    if (canConfig->busConfig == VALUE_BUS_CONFIG_29bit_125kbit
	|| canConfig->busConfig == VALUE_BUS_CONFIG_29bit_250kbit
	|| canConfig->busConfig == VALUE_BUS_CONFIG_29bit_500kbit
	|| canConfig->busConfig == VALUE_BUS_CONFIG_29bit_1000kbit) {
	TxMessage.ExtId = data->recv;	/* Extended CAN identifier 29bit */
	TxMessage.IDE = CAN_ID_EXT;	/* IDE=1 for Extended CAN identifier 29 bit */
    } else {
	TxMessage.StdId = data->recv;	/* Standard CAN identifier 11bit */
	TxMessage.IDE = CAN_ID_STD;	/* IDE=0 for Standard CAN identifier 11 bit */
    }

    TxMessage.RTR = CAN_RTR_DATA;	/* Data frame */
    TxMessage.DLC = data->len;	/* Data length code */

    TxMessage.Data[0] = data->data[0];
    TxMessage.Data[1] = data->data[1];
    TxMessage.Data[2] = data->data[2];
    TxMessage.Data[3] = data->data[3];
    TxMessage.Data[4] = data->data[4];
    TxMessage.Data[5] = data->data[5];
    TxMessage.Data[6] = data->data[6];
    TxMessage.Data[7] = data->data[7];

    /* transmit whole CAN frame as specified above on CAN1 */
    /* Tx-Counter is increased in CAN-Tx interrupt routine */
    CAN_Transmit(CAN1, &TxMessage);

    DEBUGUARTPRINT("\r\n*** bus_send_can finished! ***");
    return pdPASS;
}

/*----------------------------------------------------------------------------*/

void bus_flush_can()
{
    DEBUGPRINT("Flush CAN\n", 'a');
}

/*----------------------------------------------------------------------------*/

void bus_param_can_spec_Print(UBaseType_t msgType, void *data,
			      printChar_cbf printchar)
{
    param_data *args;
    args = data;
    DEBUGPRINT
	("Bus Parameter received via Outputtask param %ld value %ld\n",
	 args->args[ARG_RECV], args->args[ARG_CMD]);

}

/*----------------------------------------------------------------------------*/

uint16_t CAN_GetFilterReg16(uint8_t FilterID, uint8_t FilterReg,
			    uint8_t FilterPos)
{
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));

    if (FilterPos == 0) {	/* IDLow */
	/* Get the LowID of the 32bit Filter register Fx.FR1 */
	if (FilterReg == 1)	/* FR1 */
	    return (uint16_t) (CAN1->sFilterRegister[FilterID].
			       FR1 & 0x0000FFFF)
		>> 5;
	else if (FilterReg == 2)	/* FR2 */
	    return (uint16_t) (CAN1->sFilterRegister[FilterID].
			       FR2 & 0x0000FFFF)
		>> 5;
	else
	    return NULL;
    } else if (FilterPos == 1) {	/* ID High */
	if (FilterReg == 1)	/* FR1 */
	    return (uint16_t) (CAN1->sFilterRegister[FilterID].FR1 >> 16 &
			       0x0000FFFF) >> 5;
	else if (FilterReg == 2)	/* FR2 */
	    return (uint16_t) (CAN1->sFilterRegister[FilterID].FR2 >> 16 &
			       0x0000FFFF) >> 5;
	else
	    return NULL;
    } else
	return NULL;
}

